# Getting Started with Pandas

In [1]:
# To get started with pandas you will need to get comfortable with its two 
# workhorse data structures: Series and DataFrame. While they are not a universal 
# solution for every problem, they provide a solid easy-to-use basis for most applications. 
import pandas as pd 
from pandas import Series, DataFrame 
import numpy as np 

# Series is a one-dimensional array-like object containing a sequence of values 
# and an associated array of data labels, called its index. The simplest Series
# is formed from only an array of data: 

obj = Series([4, 7, -5, 3]) 
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [2]:
# The string representation of a Series displayed interactively shows the index on the left
# and the values on the right. Since we did not specify an index for the data, a default
# one consisting of the integers 0 through N - 1 (where N is the length of the data) is
# created. You can get the array representation and index object of the Series via its values
# and index attributes, respectively: 
obj.values

array([ 4,  7, -5,  3])

In [3]:
obj.index # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [4]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c']) 
obj2['a']

-5

In [5]:
obj2['d'] = 6 
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [6]:
# Numpy array operations, such as filtering with a boolean array, scalar multiplication, 
# or applying math functions, will preserve the index-value link: 

obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [7]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [8]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [9]:
# Another way to think about a Series is as a fixed-length, ordered dict, as it is a mapping
# of index values to data values. It can be substituted into many functions that expect a
# dict: 

'b' in obj2

True

In [10]:
'e' in obj2

False

In [11]:
# Should you have data contained in a Python dict, you can create a Series from it by passing the dict: 

sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000} 
obj3 = Series(sdata) 
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [12]:
states = ['California', 'Ohio', 'Oregon', 'Texas'] 
obj4 = Series(sdata, index=states)

In [13]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [14]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [15]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [16]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [17]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [18]:
obj4.name = 'population' 
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [19]:
# A Series's index can be altered in place by assignment 
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan'] 
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

# DataFrame

In [20]:
# A DataFrame represents a tabular spreadsheet-like data structure containing an ordered collection 
# of columns, each of which can be a different value type (numeric, string, boolean,etc..)
# The DataFrame has both a row and column index: it can be thought of as dict of Series all sharing 
# the same index. Under the hood, the data is stored as one or more two-dimensional blocks rather than 
# a list, dict, or some other collection of one-dimensional arrays. 

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]
        }
frame = DataFrame(data) 
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [21]:
# If you specify a sequence of columns, the DataFrame's  columns will be arranged in that order:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [22]:
# As with Series, if you pass a column that isn't contained in data, it will appear with NA values in the result: 

frame2 = DataFrame(data, columns= ['year', 'state', 'pop', 'debt'], 
                    index=['one', 'two', 'three', 'four','five']) 
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [23]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [24]:
# A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute: 
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [25]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [26]:
# Note that returned Series have the same index as the DataFrame, and their name attribute has been appropriately set. 
# Rows can also be retrieved by position or name with the special loc attribute: 
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [28]:
# Columns can be modified by assignment. 
# For example, the empty debt column could be assigned a scalar values or an array of values
frame2['debt'] = 16.5 
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [29]:
frame2['debt'] = np.arange(5.) 
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [30]:
# when assigning lists or arrays to a column, the value's legnth must match the length of the DataFrame. 
# If you assign a Series, its labels will be realigned exactly to the DataFrame's index, inserting missing values in any holes:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five']) 
frame2['debt'] = val 
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [31]:
# Assigning a column that doesn't exist will create a new column. The del keyword will delete columns as with a dict:
frame2['eastern'] = frame2.state == 'Ohio' 
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [32]:
del frame2['eastern']

In [33]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [34]:
# Another common form of data is a nested dict of dicts format:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}
        } 
frame3 = DataFrame(pop) 
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [35]:
# You can transpose the DataFrame (swap rows and columns) with similar syntax to a NumPy array: 
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5